# Insert Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireTypeSet..::..Insert Method
WireTypeSet Class See Also
---
Insert the specified wire type into the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	WireType item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As WireType _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	WireType^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB.Electrical..::..WireTypeThe wire type to be inserted into the set.
# ### Return Value
Returns whether the wire type was inserted into the set.
# See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace